title: Suspicious Usage of socat
id: 1fbec72e-50d4-4c98-89e0-b8b8901eac04
status: experimental
description: Detects execution of socat with network or execution redirections.
logsource:
  product: linux
  service: audit
detection:
  selection:
    process_name: socat
  condition: selection and suspicious_context
  suspicious_context:
    message|contains:
    - 'TCP:'
    - 'EXEC:'
    - 'SYSTEM:'
    - PTY
level: high
tags:
- attack.execution
- attack.t1204
version: 1
falsepositives:
- Legitimate socat usage by system administrators
- Automated system scripts
