title: Suspicious Usage of ruby
id: fa6b1601-bd1b-4722-8697-da640ad83edf
status: experimental
description: Detects execution of ruby with inline execution or network operations.
logsource:
  product: linux
  service: audit
detection:
  selection:
    process_name: ruby
  condition: selection and suspicious_context
  suspicious_context:
    message|contains:
    - '-e '
    - TCPSocket
    - system(
    - exec(
level: medium
tags:
- attack.execution
- attack.t1204
version: 1
falsepositives:
- Legitimate ruby usage by system administrators
- Automated system scripts
