title: Suspicious Usage of shadow
id: 262ec507-79bb-43b0-a641-3bb9cf69a4b4
status: experimental
description: Detects execution of potentially suspicious binary shadow.
logsource:
  product: linux
  service: audit
detection:
  selection:
    process_name: shadow
  condition: selection
level: low
tags:
- attack.execution
- attack.t1204
