title: Suspicious Usage of wget
id: 141358f7-27c7-4b9c-a4f3-0cdc490e7c9b
status: experimental
description: Detects execution of potentially suspicious binary wget.
logsource:
  product: linux
  service: audit
detection:
  selection:
    process_name: wget
  condition: selection
level: low
tags:
- attack.execution
- attack.t1204
