title: Suspicious Usage of ncat
id: c5613cc5-4dbd-489e-b2c9-28bcd5ee9ea2
status: experimental
description: Detects execution of ncat with execute or listen flags.
logsource:
  product: linux
  service: audit
detection:
  selection:
    process_name: ncat
  condition: selection and suspicious_context
  suspicious_context:
    message|contains:
    - '-e '
    - '-c '
    - --sh-exec
    - -l
level: high
tags:
- attack.execution
- attack.t1204
version: 1
falsepositives:
- Legitimate ncat usage by system administrators
- Automated system scripts
