title: Suspicious Usage of id
id: a030b6cb-b30e-4c06-91b6-3f1df0cddc67
status: experimental
description: Detects execution of id in command chain suggesting enumeration.
logsource:
  product: linux
  service: audit
detection:
  selection:
    process_name: id
  condition: selection and suspicious_context
  suspicious_context:
    message|contains:
    - '| grep'
    - '&&'
    - ; whoami
    - root
level: medium
tags:
- attack.execution
- attack.t1204
version: 1
falsepositives:
- Legitimate id usage by system administrators
- Automated system scripts
