title: Suspicious Usage of dd
id: 2fe382db-f191-4c01-af3e-3dff8ab380cb
status: experimental
description: Detects execution of potentially suspicious binary dd.
logsource:
  product: linux
  service: audit
detection:
  selection:
    process_name: dd
  condition: selection
level: low
tags:
- attack.execution
- attack.t1204
