title: Suspicious Usage of lua
id: 1f1a868f-1f24-4435-b934-a82c58918b1b
status: experimental
description: Detects execution of potentially suspicious binary lua.
logsource:
  product: linux
  service: audit
detection:
  selection:
    process_name: lua
  condition: selection
level: low
tags:
- attack.execution
- attack.t1204
