title: Suspicious Usage of curl
id: f9cba04d-c56b-45bb-8ece-c664e79bb94e
status: experimental
description: Detects execution of potentially suspicious binary curl.
logsource:
  product: linux
  service: audit
detection:
  selection:
    process_name: curl
  condition: selection
level: low
tags:
- attack.execution
- attack.t1204
