title: Suspicious Usage of modprobe
id: a02a5117-562d-4b9b-a782-2ca880d0d0f9
status: experimental
description: Detects execution of modprobe loading modules from non-standard paths.
logsource:
  product: linux
  service: audit
detection:
  selection:
    process_name: modprobe
  condition: selection and suspicious_context
  suspicious_context:
    message|contains:
    - /tmp/
    - /home/
    - force
level: high
tags:
- attack.execution
- attack.t1204
version: 1
falsepositives:
- Legitimate modprobe usage by system administrators
- Automated system scripts
