title: Suspicious Usage of strace
id: 4a094fc9-8c77-4699-bd12-789f9763313b
status: experimental
description: Detects execution of strace tracing other processes.
logsource:
  product: linux
  service: audit
detection:
  selection:
    process_name: strace
  condition: selection and suspicious_context
  suspicious_context:
    message|contains:
    - '-p '
    - '-f '
    - -e trace=
level: medium
tags:
- attack.execution
- attack.t1204
version: 1
falsepositives:
- Legitimate strace usage by system administrators
- Automated system scripts
