title: Credential Access via Certutil Certificate Export
id: f7631d5e-547d-401c-a3b8-c7868d001cbd
status: stable
description: Detects usage of certutil.exe to export certificates which may contain
  private keys for authentication.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \certutil.exe
    CommandLine|contains|all:
    - -exportPFX
    - -p
  condition: selection
level: high
tags:
- attack.credential_access
- attack.t1649
falsepositives:
- Certificate management by PKI administrators
version: 1
