title: Credential Dumping via Comsvcs with Rundll32
id: 25cd32c8-77f9-4f4d-b462-b2debfbd4f01
status: stable
description: Detects usage of rundll32 with comsvcs.dll to dump process memory, commonly
  targeting LSASS.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \rundll32.exe
    CommandLine|contains|all:
    - comsvcs.dll
    - '#24'
  condition: selection
level: critical
tags:
- attack.credential_access
- attack.t1003.001
falsepositives:
- Legitimate debugging by software vendors
version: 1
