title: Credential Dumping via Windows Task Manager
id: 82ee1daf-f6f3-4c67-b2f2-4cae1d573dca
status: stable
description: Detects creation of LSASS dump files by Task Manager, which can be used
  to extract credentials.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \Taskmgr.exe
    CommandLine|contains: lsass
  condition: selection
level: high
tags:
- attack.credential_access
- attack.t1003.001
falsepositives:
- Debugging by IT administrators
version: 1
