title: Group Policy Preferences Password Extraction
id: dc8fc550-1312-4300-b652-f217cdd767ab
status: stable
description: Detects tools searching for cpassword in Group Policy Preferences XML
  files.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - cpassword
    - Groups.xml
    - gpp-decrypt
  condition: selection
level: high
tags:
- attack.credential_access
- attack.t1552.006
falsepositives:
- GPP auditing by security teams
version: 1
