title: LSA Secrets Registry Extraction
id: 44462da8-031e-4d7b-90e5-447e2ed79a26
status: stable
description: Detects extraction of LSA Secrets from the registry, which stores service
  account passwords and other sensitive data.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - save
    - security
  filter:
    Image|endswith: \regedit.exe
  condition: selection and not filter
level: high
tags:
- attack.credential_access
- attack.t1003.004
falsepositives:
- Registry backup tools
version: 1
