title: NPPSpy Credential Interception
id: a23fe2ce-36a9-4024-93ba-756d8cdc88b5
status: stable
description: Detects installation of NPPSpy or similar credential-intercepting DLLs
  in the Network Provider order.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - NPPSpy
    - nppspy
    - Network Provider
  condition: selection
level: high
tags:
- attack.credential_access
- attack.t1556
falsepositives:
- Network authentication module installation
version: 1
