title: WiFi Password Extraction via Netsh
id: 9805bad1-2c7f-4278-8722-85719dbec2f5
status: stable
description: Detects extraction of stored WiFi passwords using netsh wlan show profile
  with key=clear.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \netsh.exe
    CommandLine|contains|all:
    - wlan
    - key=clear
  condition: selection
level: medium
tags:
- attack.credential_access
- attack.t1552.001
falsepositives:
- IT support recovering WiFi credentials
version: 1
