title: Windows Credential Manager Access via VaultCmd
id: 99c4f43a-a88a-4662-aec5-7cdf80672feb
status: stable
description: Detects usage of VaultCmd.exe to enumerate or export Windows Credential
  Manager entries.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \vaultcmd.exe
    CommandLine|contains:
    - /list
    - /listcreds
  condition: selection
level: medium
tags:
- attack.credential_access
- attack.t1555
falsepositives:
- IT inventory scripts
version: 1
