title: Windows Credential Dumping via Secretsdump
id: 12548bdc-99ce-48f3-93d3-60e2d156a90e
status: stable
description: Detects execution of secretsdump.py or similar Impacket tools for credential
  extraction.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - secretsdump
    - impacket
  condition: selection
level: critical
tags:
- attack.credential_access
- attack.t1003
falsepositives:
- Authorized penetration testing
version: 1
