title: Remote Service Creation via SC
id: 493fb48f-296b-4dff-9fa4-f8933b11ba81
status: stable
description: Detects remote service creation using sc.exe with the \\hostname syntax.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \sc.exe
    CommandLine|contains|all:
    - \\
    - create
  condition: selection
level: high
tags:
- attack.lateral_movement
- attack.t1021.002
falsepositives:
- Legitimate remote service management
version: 1
