title: SharpRDP Lateral Movement
id: c14b23f9-e3cd-4abb-9d07-8ff112654c25
status: stable
description: Detects indicators of SharpRDP or similar tools performing authenticated
  RDP lateral movement.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - SharpRDP
    - xfreerdp
    - rdesktop
  condition: selection
level: high
tags:
- attack.lateral_movement
- attack.t1021.001
falsepositives:
- Legitimate RDP client usage
version: 1
