title: Windows Remote Management Shell via Winrs
id: 700f994e-61b3-4a89-958a-3d2ab00e865a
status: stable
description: Detects usage of winrs.exe for remote command execution over WinRM.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \winrs.exe
    CommandLine|contains: '-r:'
  condition: selection
level: high
tags:
- attack.lateral_movement
- attack.t1021.006
falsepositives:
- Legitimate remote administration
version: 1
