title: "BLUELIGHT RAT: YARA Keylogger Component (APT_MAL_Win_BlueLight_B)"
id: bl-s0657-yara-keylog-001
status: stable
description: >
  Detects BLUELIGHT keylogger component strings. The malware logs keystrokes
  with modifier prefixes (SHIFT+, CTRL+, CAPSLOCK+, ALT+) and special key
  markers ([TAB], [RETURN], [ESC], [ARROW *], [DEL], [WIN]). The keylogger
  output is staged for exfiltration via OneDrive. Based on Volexity YARA rule
  APT_MAL_Win_BlueLight_B $keylogger_component strings (27 of 29 required).
references:
  - https://github.com/Neo23x0/signature-base/blob/master/yara/apt_apt37_bluelight.yar
  - https://www.volexity.com/blog/2021/08/17/north-korean-apt-inkysquid-infects-victims-using-browser-exploits/
author: SOC Detection Engineering (YARA source: threatintel@volexity.com)
date: 2026/03/19
logsource:
  product: windows
  category: file_event
  service: sysmon
detection:
  selection_keylog_files:
    TargetFilename|endswith:
      - '.dat'
      - '.log'
      - '.tmp'
    TargetFilename|contains:
      - 'cheV01'
      - 'INTEG.RAW'
      - 'keylog'
  selection_edb_files:
    TargetFilename|contains:
      - 'edb.chk'
      - 'edb.log'
      - 'edbres00001.jrs'
      - 'edbres00002.jrs'
      - 'edbtmp.log'
  condition: selection_keylog_files or selection_edb_files
level: high
tags:
  - attack.collection
  - attack.t1056.001
  - apt.apt37
  - malware.bluelight
  - yara.APT_MAL_Win_BlueLight_B
falsepositives:
  - Windows Exchange/ESE database operations create edb.* files legitimately
  - The cheV01.dat file is unique to BLUELIGHT
version: 1
