title: CMSTP UAC Bypass
id: f4a27819-5417-4450-b894-b6cdb9ed3e85
status: stable
description: Detects usage of CMSTP.exe to bypass UAC and execute arbitrary commands
  through .inf files.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \cmstp.exe
    CommandLine|contains: /s
  condition: selection
level: high
tags:
- attack.defense_evasion
- attack.t1218.003
falsepositives:
- Legitimate Connection Manager profile installation
version: 1
