title: ETW Provider Disabled
id: c5960c2a-ae04-4e57-bf4e-ac2d27435683
status: stable
description: Detects disabling of ETW (Event Tracing for Windows) providers, which
  can blind security monitoring.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - logman
    - stop
    - EventLog
  condition: selection
level: high
tags:
- attack.defense_evasion
- attack.t1562.002
falsepositives:
- Performance troubleshooting
version: 1
