title: File Deletion of Security Tools
id: 41743b31-7eae-4253-a4a1-230c295990e2
status: stable
description: Detects deletion of security-related files and configurations that could
  impair defenses.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - del
    - /f
  filter_system:
    Image|startswith: C:\Windows\System32\
  condition: selection and not filter_system
level: medium
tags:
- attack.defense_evasion
- attack.t1070.004
falsepositives:
- Cleanup scripts
- Build processes
version: 1
