title: Masquerading System Binary in Non-Standard Path
id: a7852382-4765-4471-a608-ddfa9979a85b
status: stable
description: Detects execution of common system binaries from non-standard locations,
  indicating masquerading.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    OriginalFileName:
    - cmd.exe
    - powershell.exe
    - svchost.exe
    - explorer.exe
  filter:
    Image|startswith:
    - C:\Windows\
    - C:\Program Files
  condition: selection and not filter
level: high
tags:
- attack.defense_evasion
- attack.t1036.005
falsepositives:
- Portable applications
version: 1
