title: Process Injection via CreateRemoteThread
id: a336fbb3-5b88-4675-9d53-d9adacb0e54f
status: stable
description: Detects suspicious processes commonly used as injection vehicles with
  command-line indicators of injection.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - VirtualAllocEx
    - WriteProcessMemory
    - CreateRemoteThread
    - NtMapViewOfSection
  condition: selection
level: high
tags:
- attack.defense_evasion
- attack.t1055.001
falsepositives:
- Debugging tools
- Anti-cheat software
version: 1
