title: Process Ghosting or Herpaderping
id: 9966735d-c25c-4a48-be8f-e3041de3b7e5
status: stable
description: Detects indicators of process ghosting or herpaderping evasion techniques
  based on suspicious process creation patterns.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - NtCreateProcessEx
    - NtCreateSection
  condition: selection
level: high
tags:
- attack.defense_evasion
- attack.t1055
falsepositives:
- Debugging or reverse engineering tools
version: 1
