title: Renamed System Binary Execution
id: 18687462-bae5-4113-a1bc-9a1c8eb34528
status: stable
description: Detects execution of renamed system utilities where the original filename
  does not match the current image name.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    OriginalFileName: powershell.exe
  filter:
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  condition: selection and not filter
level: high
tags:
- attack.defense_evasion
- attack.t1036.003
falsepositives:
- Custom-wrapped PowerShell executables
version: 1
