title: Windows Defender Exclusion Added via PowerShell
id: db0ffc3b-6e92-410b-94aa-f0d5c8f68b2e
status: stable
description: Detects addition of Windows Defender exclusions via PowerShell, often
  used to whitelist malware locations.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - Add-MpPreference
    - -ExclusionPath
  condition: selection
level: high
tags:
- attack.defense_evasion
- attack.t1562.001
falsepositives:
- Developer adding build folders to exclusions
version: 1
