title: Active Setup Persistence
id: f69f445d-8d53-43cf-ab1d-ad4171b5ca3b
status: stable
description: Detects creation of Active Setup entries in the registry for per-user
  persistence.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - Active Setup
    - StubPath
  condition: selection
level: high
tags:
- attack.persistence
- attack.t1547.014
falsepositives:
- Legitimate Active Setup entries from software installers
version: 1
