title: Boot Configuration Change for Persistence
id: 90b3d3ec-1650-4bd3-9284-c18eebe9cf6d
status: stable
description: Detects BCDEdit commands that modify boot configuration for safe mode
  persistence.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \bcdedit.exe
    CommandLine|contains:
    - safeboot
    - bootstatuspolicy
  condition: selection
level: high
tags:
- attack.persistence
- attack.t1542
falsepositives:
- Boot troubleshooting
version: 1
