title: Print Processor Persistence
id: 0905efd5-d0c6-40de-a470-79d8fd1c0887
status: stable
description: Detects registration of malicious print processors for persistence via
  the Print Spooler service.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - Print Processors
    - reg
    - add
  condition: selection
level: high
tags:
- attack.persistence
- attack.t1547.012
falsepositives:
- Legitimate print processor installation
version: 1
