title: Registry Run Key Modification via Reg.exe
id: 02ef8d90-08ae-447f-9b35-6807634d16ac
status: stable
description: Detects registry run key modifications using reg.exe for persistence.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \reg.exe
    CommandLine|contains|all:
    - add
    - CurrentVersion\Run
  condition: selection
level: high
tags:
- attack.persistence
- attack.t1547.001
falsepositives:
- Software installation scripts
version: 1
