title: Windows Service Created with Suspicious Binary Path
id: 624b2ce3-6fe8-47ab-a74e-2862cbc49e24
status: stable
description: Detects creation of Windows services pointing to executables in user-writable
  paths.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \sc.exe
    CommandLine|contains: create
  suspicious_path:
    CommandLine|contains:
    - \Temp\
    - \AppData\
    - \Users\
  condition: selection and suspicious_path
level: high
tags:
- attack.persistence
- attack.t1543.003
falsepositives:
- User-installed services
version: 1
