title: WMI Event Subscription Persistence
id: 60e21bc5-b986-4a04-8ae6-c9d3b25fe70d
status: stable
description: Detects creation of WMI event subscriptions for fileless persistence.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - ActiveScriptEventConsumer
    - __EventFilter
  condition: selection
level: high
tags:
- attack.persistence
- attack.t1546.003
falsepositives:
- WMI-based monitoring software
version: 1
