title: 'Cloud Guard Problem: Audit Log Retention'
id: 323f7813-0c1e-48d8-9b7d-6aa98a963942
status: stable
description: 'Detects Cloud Guard reporting problem: Audit_Log_Retention.'
logsource:
  product: oci
  service: cloud_guard
detection:
  selection:
    problem_name: Audit_Log_Retention
  condition: selection
level: high
tags:
- oci.cloud_guard
