title: 'Cloud Guard Problem: Bucket Public Write'
id: 9a6c6c06-0967-41ae-99fd-376b2b0d1426
status: stable
description: 'Detects Cloud Guard reporting problem: Bucket_Public_Write.'
logsource:
  product: oci
  service: cloud_guard
detection:
  selection:
    problem_name: Bucket_Public_Write
  condition: selection
level: high
tags:
- oci.cloud_guard
