title: 'Cloud Guard Problem: Bucket Public Read'
id: e8d34b6b-b877-45ab-a23e-c3e78af06b71
status: stable
description: 'Detects Cloud Guard reporting problem: Bucket_Public_Read.'
logsource:
  product: oci
  service: cloud_guard
detection:
  selection:
    problem_name: Bucket_Public_Read
  condition: selection
level: high
tags:
- oci.cloud_guard
