title: 'Cloud Guard Problem: IAM User Console Password Old'
id: 2cf17b40-c22e-4ca3-9de8-5169651a1f1a
status: stable
description: 'Detects Cloud Guard reporting problem: IAM_User_Console_Password_Old.'
logsource:
  product: oci
  service: cloud_guard
detection:
  selection:
    problem_name: IAM_User_Console_Password_Old
  condition: selection
level: high
tags:
- oci.cloud_guard
