title: 'Cloud Guard Problem: IAM User API Key Old'
id: 1f3fa599-8f20-428f-a253-79832933e825
status: stable
description: 'Detects Cloud Guard reporting problem: IAM_User_API_Key_Old.'
logsource:
  product: oci
  service: cloud_guard
detection:
  selection:
    problem_name: IAM_User_API_Key_Old
  condition: selection
level: high
tags:
- oci.cloud_guard
