title: 'Cloud Guard Problem: Policy Too Permissive'
id: b41e83fc-910d-473d-befb-9475109aa4a7
status: stable
description: 'Detects Cloud Guard reporting problem: Policy_Too_Permissive.'
logsource:
  product: oci
  service: cloud_guard
detection:
  selection:
    problem_name: Policy_Too_Permissive
  condition: selection
level: high
tags:
- oci.cloud_guard
- attack.privilege_escalation
- attack.t1098
version: 1
falsepositives:
- Authorized administrative operations
