title: 'Cloud Guard Problem: VCN Security List Port RDP'
id: 7f8abb6a-4159-42ac-b20a-8eac660e3100
status: stable
description: 'Detects Cloud Guard reporting problem: VCN_Security_List_Port_RDP.'
logsource:
  product: oci
  service: cloud_guard
detection:
  selection:
    problem_name: VCN_Security_List_Port_RDP
  condition: selection
level: high
tags:
- oci.cloud_guard
