title: 'Cloud Guard Problem: VCN Security List Port SSH'
id: fe8587f3-b7ba-4232-8606-154f594d6889
status: stable
description: 'Detects Cloud Guard reporting problem: VCN_Security_List_Port_SSH.'
logsource:
  product: oci
  service: cloud_guard
detection:
  selection:
    problem_name: VCN_Security_List_Port_SSH
  condition: selection
level: high
tags:
- oci.cloud_guard
- attack.initial_access
- attack.t1133
version: 1
falsepositives:
- Authorized administrative operations
