fields:
  CommandLine:
    target: '''Command Line'''
    role: initiator
  EventID:
    target: '''Event ID'''
    role: resource
  EventId:
    target: '''Event ID'''
    role: resource
  FileName:
    target: '''Process Name'''
    role: initiator
  FilePath:
    target: '''Target Filename'''
    role: initiator
  FolderPath:
    target: '''Target Filename'''
    role: initiator
  Hash:
    target: Hashes
    role: hash
  MD5:
    target: Hashes
    role: hash
  SHA1:
    target: Hashes
    role: hash
  SHA256:
    target: Hashes
    role: hash
  Image:
    target: '''Process Name'''
    role: initiator
  InitiatingProcessCommandLine:
    target: '''Command Line'''
    role: initiator
  InitiatingProcessFileName:
    target: '''Parent Process Name'''
    role: initiator
  InitiatingProcessParentFileName:
    target: '''Parent Process Name'''
    role: initiator
  InitiatingProcessFolderPath:
    target: '''Parent Process Name'''
    role: initiator
  InitiatingProcessAccountDomain:
    target: '''Target Domain Name'''
    role: initiator
  InitiatingProcessAccountName:
    target: '''Account Name'''
    role: initiator
  InitiatingProcessSHA256:
    target: Hashes
    role: hash
  InitiatingProcessId:
    target: '''Process ID'''
    role: initiator
  LogonType:
    target: '''Logon Type'''
    role: resource
  Logon_Type:
    target: '''Logon Type'''
    role: resource
  ParentImage:
    target: '''Parent Process Name'''
    role: initiator
  ParentProcessName:
    target: '''Parent Process Name'''
    role: initiator
  Process:
    target: '''Process Name'''
    role: initiator
  ProcessId:
    target: '''Process ID'''
    role: initiator
  ProcessCommandLine:
    target: '''Command Line'''
    role: initiator
  ProcessName:
    target: '''Process Name'''
    role: initiator
  Exe:
    target: '''Process Name'''
    role: initiator
  LocalFile:
    target: '''Target Filename'''
    role: resource
  ActingProcessCommandLine:
    target: '''Command Line'''
    role: initiator
  ActingProcessName:
    target: '''Parent Process Name'''
    role: initiator
  ActingProcessSHA256:
    target: Hashes
    role: hash
  ActingProcessFileInternalName:
    target: '''Parent Process Name'''
    role: initiator
  SrcFileName:
    target: '''Target Filename'''
    role: initiator
  SourceFileName:
    target: '''Target Filename'''
    role: initiator
  TargetFileMD5:
    target: Hashes
    role: hash
  TargetFileName:
    target: '''Target Filename'''
    role: target
  TargetFilePath:
    target: '''Target Filename'''
    role: target
  TargetFileSHA1:
    target: Hashes
    role: hash
  TargetFileSHA256:
    target: Hashes
    role: hash
  UserId:
    target: '''User ID (hashed)'''
    role: hash
