title: Finger.exe Abuse for File Download
id: 78d3ae3b-3fec-4e6b-afa9-b4bf228f59a7
status: stable
description: Detects abuse of finger.exe to download files or exfiltrate data via
  the finger protocol.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \finger.exe
  condition: selection
level: medium
tags:
- attack.execution
- attack.t1105
falsepositives:
- Legitimate finger protocol usage (rare in modern networks)
version: 1
