title: Windows Management Instrumentation Event Subscription
id: d82a237e-2350-4d2a-b035-d611c0efdbba
status: stable
description: Detects WMI event subscription creation for persistence via command-line
  WMI tools.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - EventFilter
    - __EventConsumer
    - CommandLineEventConsumer
  condition: selection
level: high
tags:
- attack.execution
- attack.t1047
falsepositives:
- WMI-based monitoring solutions
version: 1
