title: WMI Process Execution via Wmic
id: 10f74b67-be01-45f1-b908-e95d309617fe
status: stable
description: Detects WMI-based process execution using wmic process call create.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \wmic.exe
    CommandLine|contains|all:
    - process
    - call
    - create
  condition: selection
level: high
tags:
- attack.execution
- attack.t1047
falsepositives:
- Legitimate WMI administration scripts
version: 1
