title: File and Directory Discovery via dir
id: 8bcc9557-7d63-42f0-bfd2-33e341989859
status: stable
description: Detects recursive directory listings often used during post-exploitation
  to find sensitive files.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith: \cmd.exe
    CommandLine|contains|all:
    - dir
    - /s
    - /b
  suspicious:
    CommandLine|contains:
    - .doc
    - .xls
    - .pdf
    - .pst
    - .kdbx
    - .config
  condition: selection and suspicious
level: medium
tags:
- attack.discovery
- attack.t1083
falsepositives:
- File inventory scripts
version: 1
