title: Local Group Membership Discovery
id: 78f4e05c-3b8d-4330-8b17-1096fd8a6cf3
status: stable
description: Detects commands enumerating local group membership, especially administrators.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - \net.exe
    - \net1.exe
    CommandLine|contains:
    - localgroup
    - administrators
  condition: selection
level: low
tags:
- attack.discovery
- attack.t1069.001
falsepositives:
- Legitimate administration
version: 1
