title: DLL Hijacking via Service Registry Permission
id: 4c82fb86-f13d-464e-997d-78318ff4ad29
status: stable
description: Detects modification of service registry entries to point to attacker-controlled
  DLLs.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains|all:
    - reg
    - add
    - ImagePath
    - Services
  condition: selection
level: high
tags:
- attack.privilege_escalation
- attack.t1574.011
falsepositives:
- Service reconfiguration by administrators
version: 1
