title: UAC Bypass via Eventvwr
id: c47fff9e-e02b-453c-b032-9be1c574130a
status: stable
description: Detects UAC bypass using eventvwr.exe registry hijacking.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith: \eventvwr.exe
    Image|endswith:
    - \cmd.exe
    - \powershell.exe
  condition: selection
level: high
tags:
- attack.privilege_escalation
- attack.t1548.002
falsepositives:
- Legitimate Event Viewer shell operations
version: 1
