title: UAC Bypass via Fodhelper
id: cb7113a7-8158-4b7e-8b5b-a305d675aaac
status: stable
description: Detects UAC bypass using fodhelper.exe to execute commands with elevated
  privileges.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith: \fodhelper.exe
  filter:
    Image|endswith: \fodhelper.exe
  condition: selection and not filter
level: high
tags:
- attack.privilege_escalation
- attack.t1548.002
falsepositives:
- Legitimate fodhelper usage
version: 1
