title: UAC Bypass via ComputerDefaults
id: c7759f01-9c95-45f5-ba6f-16fb3a9f3c5a
status: stable
description: Detects UAC bypass using computerdefaults.exe auto-elevation.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    ParentImage|endswith: \computerdefaults.exe
    Image|endswith:
    - \cmd.exe
    - \powershell.exe
  condition: selection
level: high
tags:
- attack.privilege_escalation
- attack.t1548.002
falsepositives:
- None expected
version: 1
