title: OCI Local Peering Gateway Created
id: d8ac164f-635e-4408-b274-8b2183ef5778
status: stable
description: Detects creation of VCN local peering gateway enabling communication
  between VCNs within same region.
references:
- https://attack.mitre.org/techniques/T1599/
logsource:
  product: oci
  service: audit
detection:
  selection:
    event_type: com.oraclecloud.virtualnetwork.createlocalpeeringgateway
  condition: selection
level: medium
tags:
- attack.lateral_movement
- attack.t1599
falsepositives:
- Multi-VCN architecture deployment
version: 1
