title: 'OCI Action: CreateSubnet'
id: 095fc1ca-9eb2-49c0-83fb-fcdb977c6951
status: stable
description: Detects the execution of CreateSubnet action in OCI.
logsource:
  product: oci
  service: audit
detection:
  selection:
    event_type: com.oraclecloud.virtualnetwork.createsubnet
  condition: selection
level: informational
tags:
- oci.audit
