title: 'OCI Action: CreateKey'
id: b47f1b30-e61d-4afe-8ac3-fbf7fb7f880e
status: stable
description: Detects the execution of CreateKey action in OCI.
logsource:
  product: oci
  service: audit
detection:
  selection:
    event_type: com.oraclecloud.kms.createkey
  condition: selection
level: informational
tags:
- oci.audit
- attack.defense_evasion
- attack.t1553
version: 1
falsepositives:
- Scheduled key rotation
- Authorized cryptographic operations
