title: OCI Vault Secret Version Deprecated
id: 3fe2f9e7-6a91-4259-abc3-9fda737c5d6b
status: stable
description: Detects deprecation of vault secret versions which may indicate secret
  rotation bypass.
references:
- https://attack.mitre.org/techniques/T1600/
logsource:
  product: oci
  service: audit
detection:
  selection:
    event_type: com.oraclecloud.vaultsecret.deprecatesecretversion
  condition: selection
level: medium
tags:
- attack.impact
- attack.t1600
falsepositives:
- Secret lifecycle management
version: 1
