title: 'OCI Action: UpdateRouteTable'
id: da881cc3-ebc2-4e59-a550-6ef8d2c72d28
status: stable
description: Detects the execution of UpdateRouteTable action in OCI.
logsource:
  product: oci
  service: audit
detection:
  selection:
    event_type: com.oraclecloud.virtualnetwork.updateroutetable
  condition: selection
level: informational
tags:
- oci.audit
