title: Account Access Removal
id: 0e2aa6b5-8a4a-483f-8e72-2f84cf780810
status: stable
description: Detects deletion or disabling of user accounts which may indicate an
  attempt to lock out legitimate users.
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    Image|endswith:
    - \net.exe
    - \net1.exe
    CommandLine|contains|all:
    - user
    - /active:no
  condition: selection
level: high
tags:
- attack.impact
- attack.t1531
falsepositives:
- Legitimate account management
version: 1
