title: Linux SSH Failed Login
id: uuid-6
status: stable
description: Detects failed SSH login attempts.
logsource:
  product: linux
  service: auth
detection:
  selection:
    process_name: sshd
    message|contains: Failed password
  condition: selection
level: low
tags:
- attack.initial_access
