title: OCI Route Table Update
id: eb715728-3f76-4c55-afd6-246f25531e2e
status: stable
description: Detects changes to VCN Route Tables.
logsource:
  product: oci
  service: audit
detection:
  selection:
    event_type:
    - com.oraclecloud.virtualnetwork.updateroutetable
    - com.oraclecloud.virtualnetwork.createroutetable
  condition: selection
level: medium
tags:
- attack.persistence
