title: OCI WAF Configuration Updated
id: 304b9611-27f5-4c59-879c-eae6f1ca4966
status: stable
description: Detects changes to Web Application Firewall configurations.
logsource:
  product: oci
  service: audit
detection:
  selection:
    event_type:
    - com.oraclecloud.waf.updatewebappfirewall
    - com.oraclecloud.waf.updatewebappfirewallpolicy
  condition: selection
level: medium
tags:
- attack.defense_evasion
- attack.t1562.007
version: 1
falsepositives:
- Planned security policy updates
- Automated WAF rule deployments
