title: OCI Object Storage Bucket Made Public
id: 3ea8400b-e89c-4a99-8eb1-6d0baa299963
status: high
description: Detects when a bucket's visibility is set to public.
logsource:
  product: oci
  service: audit
detection:
  selection:
    event_type: com.oraclecloud.objectstorage.updatebucket
    response_payload|contains: '"publicAccessType":"ObjectRead"'
  condition: selection
level: high
tags:
- attack.exfiltration
- attack.t1537
version: 1
falsepositives:
- Routine storage operations by authorized administrators
- Automated backup or archival processes
