title: OCI IAM Policy Modified
id: 7ef0e132-0491-4b9b-9228-dfe953a97ae1
status: stable
description: Detects changes to OCI IAM Policies.
logsource:
  product: oci
  service: audit
detection:
  selection:
    event_type:
    - com.oraclecloud.identitycontrolplane.createpolicy
    - com.oraclecloud.identitycontrolplane.updatepolicy
    - com.oraclecloud.identitycontrolplane.deletepolicy
  condition: selection
level: medium
tags:
- attack.persistence
