title: OCI Network Security Group Updated
id: b8dd55ff-e76f-426b-aae4-0e850f209bed
status: stable
description: Detects updates to Network Security Groups (NSGs).
logsource:
  product: oci
  service: audit
detection:
  selection:
    event_type:
    - com.oraclecloud.virtualnetwork.updatenetworksecuritygroup
    - com.oraclecloud.virtualnetwork.addnetworksecuritygroupsecurityrules
  condition: selection
level: medium
tags:
- attack.defense_evasion
- attack.t1562.007
version: 1
falsepositives:
- Routine IAM group management
- Automated provisioning systems
