title: 'Windows LOLBin Usage: regsvr32'
id: aa90d7d6-a6fb-4d57-8450-6d41c189342c
status: experimental
description: Detects usage of Living off the Land binary regsvr32.
logsource:
  product: windows
  service: process_creation
detection:
  selection:
    process_name|endswith: regsvr32.exe
  condition: selection
level: medium
tags:
- attack.defense_evasion
- attack.t1218
