title: 'Windows LOLBin Usage: whoami'
id: 5ae8143c-7938-4185-8bd7-b761f0cf17aa
status: experimental
description: Detects usage of Living off the Land binary whoami.
logsource:
  product: windows
  service: process_creation
detection:
  selection:
    process_name: whoami.exe
  condition: selection
level: medium
tags:
- attack.defense_evasion
- attack.t1218
